<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"ea076754c3ad75f21a55c6343b3e2b8a98b5d6cb5221bd40c1dcebac029beac3","plan_job_ref":"Job Environment Main - Plan #151 at https://github.com/jarrod-lowe/wildsea/actions/runs/10643649098","plan_out_hash":"a456214266d49cab3145c18a49b6e5b79e3c4c3794c91cbd453786030c2a8600","plan_hash":"05e3a0d7f4b3f8b81bedbaa7506aea0dc8de44022b9f9bab2e31a54f5428e4b8","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform/environment/wildsea__
With backend config: `bucket=terraform-state-021891603679 key=primary/terraform.tfstate region=ap-southeast-2`<details open><summary>With variables</summary>

```hcl
environment       = "primary"
saml_metadata_url = (sensitive value)
```
</details>
<details>
<summary>Plan: 1 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.wildsea.data.aws_iam_policy_document.graphql_datasource will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "graphql_datasource" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "dynamodb:BatchGetItem",
+               "dynamodb:GetItem",
+               "dynamodb:PutItem",
+               "dynamodb:Query",
+               "dynamodb:UpdateutItem",
            ]
+           resources = [
+               "arn:aws:dynamodb:ap-southeast-2:021891603679:table/Wildsea-primary",
+               "arn:aws:dynamodb:ap-southeast-2:021891603679:table/Wildsea-primary/index/*",
            ]
        }
    }

  # module.wildsea.aws_appsync_graphql_api.graphql will be updated in-place
!~  resource "aws_appsync_graphql_api" "graphql" {
        id                   = "tfiz6mnf2nhyzpzkwm554sir5q"
        name                 = "Wildsea-primary"
!~      schema               = <<-EOT
            scalar AWSTime
            scalar AWSDateTime
            scalar AWSTimestamp
            scalar AWSEmail
            scalar AWSJSON
            scalar AWSURL
            scalar AWSPhone
            scalar AWSIPAddress
            
            directive @aws_subscribe(mutations: [String!]!) on FIELD_DEFINITION
            directive @aws_auth(cognito_groups: [String!]!) on FIELD_DEFINITION
            directive @aws_api_key on FIELD_DEFINITION | OBJECT
            directive @aws_iam on FIELD_DEFINITION | OBJECT
            directive @aws_oidc on FIELD_DEFINITION | OBJECT
            directive @aws_cognito_user_pools(
              cognito_groups: [String!]
            ) on FIELD_DEFINITION | OBJECT
            
            type Mutation {
                createGame(input: CreateGameInput!): Game! @aws_cognito_user_pools
            }
            
            type Query {
                getGame(id: ID!): Game! @aws_cognito_user_pools
          +     getGames: [GameSummary!] @aws_cognito_user_pools
            }
            
            input CreateGameInput {
                name: String!
                description: String
            }
            
            type Game @aws_cognito_user_pools {
          -   id: ID!
          -   name: String!
          -   description: String
          +   gameId: ID!
          +   gameName: String!
          +   gameDescription: String
              publicNotes: String
              privateNotes: String
              fireflyUserId: ID!
              players: [ID!]
            #  playerSheets: [PlayerSheet!]!
            #  shipSheet: ShipSheet
            #  clocks: [Clock!]!
              createdAt: AWSDateTime!
              updatedAt: AWSDateTime!
          +   type: String!
            }
          + 
          + type GameSummary @aws_cognito_user_pools {
          +   gameId: ID!
          +   gameName: String!
          +   gameDescription: String!
          +   type: String!
          + }
        EOT
        tags                 = {
            "Name" = "Wildsea-primary"
        }
#        (9 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # module.wildsea.aws_appsync_resolver.resolver["createGame"] will be updated in-place
!~  resource "aws_appsync_resolver" "resolver" {
!~      code              = <<-EOT
            // mutation/createGame/appsync.ts
            import { util } from "@aws-appsync/utils";
          + 
          + // environment.json
          + var environment_default = { name: "primary" };
          + 
          + // mutation/createGame/appsync.ts
            function request(context) {
              if (!context.identity) {
                util.error("Unauthorized: Identity information is missing.");
              }
              const identity = context.identity;
              if (!identity.sub) {
                util.error("Unauthorized: User ID is missing.");
              }
              const input = context.arguments.input;
              const id = util.autoId();
              const timestamp = util.time.nowISO8601();
          -   return {
          -     operation: "PutItem",
          +   context.stash.record = {
          +     gameName: input.name,
          +     gameDescription: input.description,
          +     gameId: id,
          +     fireflyUserId: identity.sub,
          +     // players: no value yet
          +     createdAt: timestamp,
          +     updatedAt: timestamp,
          +     type: "GAME"
          +   };
          +   const gameItem = {
                key: util.dynamodb.toMapValues({ PK: "GAME#" + id, SK: "GAME" }),
          +     operation: "PutItem",
          +     table: "Wildsea-" + environment_default.name,
          +     attributeValues: util.dynamodb.toMapValues(
          +       context.stash.record
          +     )
          +   };
          +   const fireflyItem = {
          +     key: util.dynamodb.toMapValues({
          +       PK: "GAME#" + id,
          +       SK: "PLAYER#GM#" + identity.sub
          +     }),
          +     operation: "PutItem",
          +     table: "Wildsea-" + environment_default.name,
                attributeValues: util.dynamodb.toMapValues({
          -       name: input.name,
          -       description: input.description,
          -       id,
          -       fireflyUserId: identity.sub,
          -       // players: no value yet
          +       userId: identity.sub,
          +       gameId: id,
          +       gameName: input.name,
          +       gameDescription: input.description,
          +       GSI1PK: "USER#" + identity.sub,
                  createdAt: timestamp,
          -       updatedAt: timestamp
          +       updatedAt: timestamp,
          +       type: "CHARACTER"
                })
              };
          +   return {
          +     operation: "TransactWriteItems",
          +     transactItems: [gameItem, fireflyItem]
          +   };
            }
            function response(context) {
              if (context.error) {
                util.appendError(context.error.message, context.error.type, context.result);
          -     return;
          +     return null;
              }
          -   return context.result;
          +   return {
          +     PK: context.result.keys[0].PK,
          +     SK: context.result.keys[0].SK,
          +     gameName: context.stash.record.gameName,
          +     gameDescription: context.stash.record.gameDescription,
          +     gameId: context.stash.record.gameId,
          +     fireflyUserId: context.stash.record.fireflyUserId,
          +     createdAt: context.stash.record.createdAt,
          +     updatedAt: context.stash.record.updatedAt,
          +     type: context.stash.record.type
          +   };
            }
            export {
              request,
              response
            };
          - //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiYXBwc3luYy50cyJdLAogICJtYXBwaW5ncyI6ICI7QUFBQSxTQUFTLFlBQTZDO0FBa0IvQyxTQUFTLFFBQ2QsU0FDd0I7QUFDeEIsTUFBSSxDQUFDLFFBQVEsVUFBVTtBQUNyQixTQUFLLE1BQU0sZ0RBQTBEO0FBQUEsRUFDdkU7QUFFQSxRQUFNLFdBQVcsUUFBUTtBQUN6QixNQUFJLENBQUMsU0FBUyxLQUFLO0FBQ2pCLFNBQUssTUFBTSxtQ0FBNkM7QUFBQSxFQUMxRDtBQUVBLFFBQU0sUUFBUSxRQUFRLFVBQVU7QUFDaEMsUUFBTSxLQUFLLEtBQUssT0FBTztBQUN2QixRQUFNLFlBQVksS0FBSyxLQUFLLFdBQVc7QUFDdkMsU0FBTztBQUFBLElBQ0wsV0FBVztBQUFBLElBQ1gsS0FBSyxLQUFLLFNBQVMsWUFBWSxFQUFFLElBQUksVUFBVSxJQUFJLElBQUksT0FBTyxDQUFDO0FBQUEsSUFDL0QsaUJBQWlCLEtBQUssU0FBUyxZQUFZO0FBQUEsTUFDekMsTUFBTSxNQUFNO0FBQUEsTUFDWixhQUFhLE1BQU07QUFBQSxNQUNuQjtBQUFBLE1BQ0EsZUFBZSxTQUFTO0FBQUE7QUFBQSxNQUV4QixXQUFXO0FBQUEsTUFDWCxXQUFXO0FBQUEsSUFDYixDQUFDO0FBQUEsRUFDSDtBQUNGO0FBRU8sU0FBUyxTQUFTLFNBQTJCO0FBQ2xELE1BQUksUUFBUSxPQUFPO0FBQ2pCLFNBQUssWUFBWSxRQUFRLE1BQU0sU0FBUyxRQUFRLE1BQU0sTUFBTSxRQUFRLE1BQU07QUFDMUU7QUFBQSxFQUNGO0FBQ0EsU0FBTyxRQUFRO0FBQ2pCOyIsCiAgIm5hbWVzIjogW10KfQo=
          + //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiYXBwc3luYy50cyIsICIuLi8uLi9lbnZpcm9ubWVudC5qc29uIl0sCiAgIm1hcHBpbmdzIjogIjtBQUFBLFNBQVMsWUFBNkM7OztBQ0F0RCw0QkFBQyxNQUFPLFVBQVM7OztBRGlCVixTQUFTLFFBQVEsU0FBdUQ7QUFDN0UsTUFBSSxDQUFDLFFBQVEsVUFBVTtBQUNyQixTQUFLLE1BQU0sZ0RBQTBEO0FBQUEsRUFDdkU7QUFFQSxRQUFNLFdBQVcsUUFBUTtBQUN6QixNQUFJLENBQUMsU0FBUyxLQUFLO0FBQ2pCLFNBQUssTUFBTSxtQ0FBNkM7QUFBQSxFQUMxRDtBQUVBLFFBQU0sUUFBUSxRQUFRLFVBQVU7QUFDaEMsUUFBTSxLQUFLLEtBQUssT0FBTztBQUN2QixRQUFNLFlBQVksS0FBSyxLQUFLLFdBQVc7QUFFdkMsVUFBUSxNQUFNLFNBQVM7QUFBQSxJQUNyQixVQUFVLE1BQU07QUFBQSxJQUNoQixpQkFBaUIsTUFBTTtBQUFBLElBQ3ZCLFFBQVE7QUFBQSxJQUNSLGVBQWUsU0FBUztBQUFBO0FBQUEsSUFFeEIsV0FBVztBQUFBLElBQ1gsV0FBVztBQUFBLElBQ1gsTUFBTTtBQUFBLEVBQ1I7QUFFQSxRQUFNLFdBQVc7QUFBQSxJQUNmLEtBQUssS0FBSyxTQUFTLFlBQVksRUFBRSxJQUFJLFVBQVUsSUFBSSxJQUFJLE9BQU8sQ0FBQztBQUFBLElBQy9ELFdBQVc7QUFBQSxJQUNYLE9BQU8sYUFBYSxvQkFBWTtBQUFBLElBQ2hDLGlCQUFpQixLQUFLLFNBQVM7QUFBQSxNQUM3QixRQUFRLE1BQU07QUFBQSxJQUNoQjtBQUFBLEVBQ0Y7QUFFQSxRQUFNLGNBQWM7QUFBQSxJQUNsQixLQUFLLEtBQUssU0FBUyxZQUFZO0FBQUEsTUFDN0IsSUFBSSxVQUFVO0FBQUEsTUFDZCxJQUFJLGVBQWUsU0FBUztBQUFBLElBQzlCLENBQUM7QUFBQSxJQUNELFdBQVc7QUFBQSxJQUNYLE9BQU8sYUFBYSxvQkFBWTtBQUFBLElBQ2hDLGlCQUFpQixLQUFLLFNBQVMsWUFBWTtBQUFBLE1BQ3pDLFFBQVEsU0FBUztBQUFBLE1BQ2pCLFFBQVE7QUFBQSxNQUNSLFVBQVUsTUFBTTtBQUFBLE1BQ2hCLGlCQUFpQixNQUFNO0FBQUEsTUFDdkIsUUFBUSxVQUFVLFNBQVM7QUFBQSxNQUMzQixXQUFXO0FBQUEsTUFDWCxXQUFXO0FBQUEsTUFDWCxNQUFNO0FBQUEsSUFDUixDQUFDO0FBQUEsRUFDSDtBQUVBLFNBQU87QUFBQSxJQUNMLFdBQVc7QUFBQSxJQUNYLGVBQWUsQ0FBQyxVQUFVLFdBQVc7QUFBQSxFQUN2QztBQUNGO0FBRU8sU0FBUyxTQUFTLFNBQStCO0FBQ3RELE1BQUksUUFBUSxPQUFPO0FBQ2pCLFNBQUssWUFBWSxRQUFRLE1BQU0sU0FBUyxRQUFRLE1BQU0sTUFBTSxRQUFRLE1BQU07QUFDMUUsV0FBTztBQUFBLEVBQ1Q7QUFDQSxTQUFPO0FBQUEsSUFDTCxJQUFJLFFBQVEsT0FBTyxLQUFLLENBQUMsRUFBRTtBQUFBLElBQzNCLElBQUksUUFBUSxPQUFPLEtBQUssQ0FBQyxFQUFFO0FBQUEsSUFDM0IsVUFBVSxRQUFRLE1BQU0sT0FBTztBQUFBLElBQy9CLGlCQUFpQixRQUFRLE1BQU0sT0FBTztBQUFBLElBQ3RDLFFBQVEsUUFBUSxNQUFNLE9BQU87QUFBQSxJQUM3QixlQUFlLFFBQVEsTUFBTSxPQUFPO0FBQUEsSUFDcEMsV0FBVyxRQUFRLE1BQU0sT0FBTztBQUFBLElBQ2hDLFdBQVcsUUFBUSxNQUFNLE9BQU87QUFBQSxJQUNoQyxNQUFNLFFBQVEsTUFBTSxPQUFPO0FBQUEsRUFDN0I7QUFDRjsiLAogICJuYW1lcyI6IFtdCn0K
        EOT
        id                = "tfiz6mnf2nhyzpzkwm554sir5q-Mutation-createGame"
#        (9 unchanged attributes hidden)

#        (1 unchanged block hidden)
    }

  # module.wildsea.aws_appsync_resolver.resolver["getGames"] will be created
+   resource "aws_appsync_resolver" "resolver" {
+       api_id      = "**************************"
+       arn         = (known after apply)
+       code        = <<-EOT
            // query/getGames/appsync.ts
            import { util } from "@aws-appsync/utils";
            function request(context) {
              if (!context.identity) {
                util.error("Unauthorized: Identity information is missing.");
              }
              const identity = context.identity;
              if (!identity.sub) {
                util.error("Unauthorized: User ID is missing.");
              }
              return {
                operation: "Query",
                index: "GSI1",
                query: {
                  expression: "#gsi1pk = :gsi1pk",
                  expressionNames: {
                    "#gsi1pk": "GSI1PK"
                  },
                  expressionValues: {
                    ":gsi1pk": util.dynamodb.toString("USER#" + identity.sub)
                  }
                }
              };
            }
            function response(context) {
              if (context.error) {
                util.appendError(context.error.message, context.error.type, context.result);
                return [];
              }
              return context.result.items;
            }
            export {
              request,
              response
            };
            //# sourceMappingURL=data:application/json;base64,ewogICJ2ZXJzaW9uIjogMywKICAic291cmNlcyI6IFsiYXBwc3luYy50cyJdLAogICJtYXBwaW5ncyI6ICI7QUFBQSxTQUFTLFlBQTZDO0FBSS9DLFNBQVMsUUFBUSxTQUF3QztBQUM5RCxNQUFJLENBQUMsUUFBUSxVQUFVO0FBQ3JCLFNBQUssTUFBTSxnREFBMEQ7QUFBQSxFQUN2RTtBQUVBLFFBQU0sV0FBVyxRQUFRO0FBQ3pCLE1BQUksQ0FBQyxTQUFTLEtBQUs7QUFDakIsU0FBSyxNQUFNLG1DQUE2QztBQUFBLEVBQzFEO0FBRUEsU0FBTztBQUFBLElBQ0wsV0FBVztBQUFBLElBQ1gsT0FBTztBQUFBLElBQ1AsT0FBTztBQUFBLE1BQ0wsWUFBWTtBQUFBLE1BQ1osaUJBQWlCO0FBQUEsUUFDZixXQUFXO0FBQUEsTUFDYjtBQUFBLE1BQ0Esa0JBQWtCO0FBQUEsUUFDaEIsV0FBVyxLQUFLLFNBQVMsU0FBUyxVQUFVLFNBQVMsR0FBRztBQUFBLE1BQzFEO0FBQUEsSUFDRjtBQUFBLEVBQ0Y7QUFDRjtBQUVPLFNBQVMsU0FBUyxTQUFpQztBQUN4RCxNQUFJLFFBQVEsT0FBTztBQUNqQixTQUFLLFlBQVksUUFBUSxNQUFNLFNBQVMsUUFBUSxNQUFNLE1BQU0sUUFBUSxNQUFNO0FBQzFFLFdBQU8sQ0FBQztBQUFBLEVBQ1Y7QUFDQSxTQUFPLFFBQVEsT0FBTztBQUN4QjsiLAogICJuYW1lcyI6IFtdCn0K
        EOT
+       data_source = "Wildsea_primary"
+       field       = "getGames"
+       id          = (known after apply)
+       kind        = "UNIT"
+       type        = "Query"

+       runtime {
+           name            = "APPSYNC_JS"
+           runtime_version = "1.0.0"
        }
    }

  # module.wildsea.aws_dynamodb_table.table will be updated in-place
!~  resource "aws_dynamodb_table" "table" {
        id                          = "Wildsea-primary"
        name                        = "Wildsea-primary"
        tags                        = {
            "Name" = "Wildsea-primary"
        }
#        (13 unchanged attributes hidden)

+       attribute {
+           name = "GSI1PK"
+           type = "S"
        }

+       global_secondary_index {
+           hash_key           = "******"
+           name               = "GSI1"
+           non_key_attributes = []
+           projection_type    = "ALL"
+           range_key          = "**"
        }

#        (4 unchanged blocks hidden)
    }

  # module.wildsea.aws_iam_policy.graphql_datasource will be updated in-place
!~  resource "aws_iam_policy" "graphql_datasource" {
        id               = "arn:aws:iam::021891603679:policy/Wildsea-primary-graphql-datasource"
        name             = "Wildsea-primary-graphql-datasource"
!~      policy           = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "dynamodb:UpdateutItem",
-                           "dynamodb:Query",
-                           "dynamodb:PutItem",
-                           "dynamodb:GetItem",
-                           "dynamodb:BatchGetItem",
                        ]
-                       Effect   = "Allow"
-                       Resource = "arn:aws:dynamodb:ap-southeast-2:021891603679:table/Wildsea-primary"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Name" = "Wildsea-primary"
        }
#        (7 unchanged attributes hidden)
    }

Plan: 1 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Environment Main - Plan #151](https://github.com/jarrod-lowe/wildsea/actions/runs/10643649098)